In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
y = df.Survived

In [17]:
data = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked',"Survived"], axis=1)

In [18]:
data.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [19]:
df = pd.get_dummies(data.Sex)

In [21]:
df.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [25]:
dataa = pd.concat([data,df],axis='columns')

In [26]:
dataa.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [80]:
d = dataa.drop('Sex',axis=1)

In [81]:
pd.isnull(dataa).any()

Pclass    False
Sex       False
Age       False
Fare      False
female    False
male      False
dtype: bool

In [82]:
d['Age'].fillna(d['Age'].mean(),inplace=True)

In [83]:
d

     Pclass        Age     Fare  female  male
0         3  22.000000   7.2500       0     1
1         1  38.000000  71.2833       1     0
2         3  26.000000   7.9250       1     0
3         1  35.000000  53.1000       1     0
4         3  35.000000   8.0500       0     1
..      ...        ...      ...     ...   ...
886       2  27.000000  13.0000       0     1
887       1  19.000000  30.0000       1     0
888       3  29.699118  23.4500       1     0
889       1  26.000000  30.0000       0     1
890       3  32.000000   7.7500       0     1

[891 rows x 5 columns]

In [84]:
pd.isnull(d).any()

Pclass    False
Age       False
Fare      False
female    False
male      False
dtype: bool

In [85]:
from sklearn.model_selection import train_test_split

In [98]:
X_train,X_test,Y_train,Y_test = train_test_split(d,y,test_size=0.2)

In [99]:
len(X_train)

712

In [100]:
len(X_test)

179

In [54]:
from sklearn.naive_bayes import GaussianNB

In [101]:
model = GaussianNB()
model

GaussianNB()

In [102]:
model.fit(X_train,Y_train)

GaussianNB()

In [103]:
X_train

     Pclass        Age      Fare  female  male
19        3  29.699118    7.2250       1     0
341       1  24.000000  263.0000       1     0
824       3   2.000000   39.6875       0     1
854       2  44.000000   26.0000       1     0
92        1  46.000000   61.1750       0     1
..      ...        ...       ...     ...   ...
53        2  29.000000   26.0000       1     0
771       3  48.000000    7.8542       0     1
28        3  29.699118    7.8792       1     0
204       3  18.000000    8.0500       0     1
855       3  18.000000    9.3500       1     0

[712 rows x 5 columns]

In [104]:
model.score(X_test,Y_test)

0.8156424581005587

In [108]:
model.predict(X_test)

array([1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0,
       1, 1, 0], dtype=int64)